from persiantools.jdatetime import JalaliDate

PEOPLE = [
    {
        "name": "آناهیتا",
        "message_type": "anahita",

        "birthday": JalaliDate(1405, 9, 30).to_gregorian(),

        "chat_ids": [
            -1004297391995,
            -1004356259615,
            -1002966097451
            
            
          
        ],

        "theme": {
            "emoji": "🌙💜🌺",
            "symbol": "🌙",
            "flower": "🌺",
            "style": "moon"
        },

        "birthday_message": """🎉🎂 تولدت مبارک خوشگل خانم 💖

امیدوارم امسال یه سال پر از سلامتی، شادی، آرامش و کلی لبخندهای قشنگ برات باشه 🌸✨
امیدوارم به همه آرزوهای قشنگت برسی و هر روزت از روز قبل بهتر و روشن‌تر باشه 🤍🌷

دوست دارم همیشه دلت پر از لبخند باشه و هیچ‌وقت غم مهمون دلت نشه 🌹🫶

با آرزوی بهترین‌ها برات
از طرف دوستدار همیشگیت و کادو دهنده دفتر رنگ‌آمیزی 🎨📖💝

تولدت هزاران بار مبارک 🎁🎈🎂"""
    },

    {
        "name": "مائده",
        "message_type": "maedeh",

        "birthday": JalaliDate(1405, 7, 23).to_gregorian(),

        "chat_ids": [
            -1004356259615,
            -1002966097451
            
        ],

        "theme": {
            "emoji": "🐺🖤🌹",
            "symbol": "🐺",
            "flower": "🌹",
            "style": "wolf"
        },

        "birthday_message": """🎉🎂

متن تبریک مخصوص مائده را بعداً اینجا بنویس.

"""
    },
{
    "name": "فاطیما",
    "message_type": "fatima",

    "birthday": JalaliDate(1405, 7, 7).to_gregorian(),

    "chat_ids": [
        -1004356259615,
        -1002966097451
    ],

    "theme": {
        "emoji": "🌸🐾🧠",
        "symbol": "🌸",
        "flower": "🌷",
        "style": "nature"
    },

    "birthday_message": """ تولدت مبارک خوشگل! 🌸🎉

امیدوارم سال جدید زندگیت پر از سلامتی، آرامش، موفقیت و کلی اتفاق قشنگ باشه و به همه آرزوهات برسی.

مرسی که این‌قدر دوست خوبی هستی و تو روزهای سخت تنهام نذاشتی. واقعاً از داشتن دوستی مثل تو خوشحالم. امیدوارم امسال پر از خنده، خاطره‌های خوب و حالِ خوب باشه و سال‌های سال دوستای خوبی برای هم بمونیم.

(از سمت سازنده بات : ازت ممنونم که هوای اونی رو که برام ارزشمنده رو داری و پیشش موندی امیدوارم سال پر برکت و شادی داشته باشی و خوشحالم که سوءتفاهم های گذشته تمام شد و رفت تولدت مبارک و لبت همیشه خندان)

بازم تولدت مبارک، امیدوارم همیشه سلامت، خوشحال و موفق باشی. 🤍🎂."""
},

{
    "name": "ثنا",
    "message_type": "sana",

    "birthday": JalaliDate(1405, 11, 17).to_gregorian(),

    "chat_ids": [
        -1004356259615,
        -1002966097451
    ],

    "theme": {
        "emoji": "🎨🎤🌼",
        "symbol": "🎨",
        "flower": "🌼",
        "style": "artist"
    },

    "birthday_message": """بعداً متن تبریک تولد ثنا اینجا قرار می‌گیرد."""
},
{
    "name": "زهرا",
    "message_type": "zahra",

    "birthday": JalaliDate(1405, 3, 17).to_gregorian(),

    "chat_ids": [
        -1004356259615,
        -1002966097451
    ],

    "theme": {
        "emoji": "🕊️🤍🌸",
        "symbol": "🕊️",
        "flower": "🌸",
        "style": "blossom"
    },

    "birthday_message": """بعداً متن تبریک تولد زهرا اینجا قرار می‌گیرد."""
},
{
    "name": "حدیث",
    "message_type": "hadis",

    "birthday": JalaliDate(1405, 3, 21).to_gregorian(),

    "chat_ids": [
        -1004356259615,
        -1002966097451
    ],

    "theme": {
        "emoji": "🦋💜💐",
        "symbol": "🦋",
        "flower": "💐",
        "style": "butterfly"
    },

    "birthday_message": """بعداً متن تبریک تولد حدیث اینجا قرار می‌گیرد."""
},
]