EVENT_MESSAGES = {
    "girls_day": {
        "normal": [
            "🌸 تا روز دختر {days} روز مونده...",
            "✨ فقط {days} روز دیگه تا روز دختر باقی مونده 💖",
            "🌷 شمارش معکوس برای روز دختر شروع شده؛ {days} روز مونده..."
        ],

        "special": {
            30: "🌸 فقط ۳۰ روز تا روز دختر مونده 💖",
            14: "✨ دو هفته تا روز دختر باقی مونده 🌷",
            7: "🎀 فقط یک هفته تا روز دختر مونده 💕",
            3: "🌸 فقط ۳ روز تا روز دختر مونده...",
            1: "💖 فردا روز دختره...",
            0: "🌸 روز دختر مبارک 💐"
        }
    }
}