EVENT_MESSAGES = {
    "girls_day": {
        "normal": [
            "🌸 تا روز دختر {days} روز مونده...",
            "✨ فقط {days} روز دیگه تا روز دختر باقی مونده 💖",
            "🌷 شمارش معکوس برای روز دختر شروع شده؛ {days} روز مونده..."
        ],

        "special": {
            30: "🌸 فقط ۳۰ روز تا روز دختر مونده 💖",
            14: "✨ فقط ۱۴ روز تا روز دختر باقی مونده 🌷",
            7: "🎀 فقط ۷ روز تا روز دختر مونده 💕",
            3: "🌸 فقط ۳ روز تا روز دختر مونده...",
            1: "💖 فردا روز دختره...",
            0: "🌸 همیشه روز دختره ولی روز دختر رو به تمام دختران سرزمینم تبریک میگم مخصوصا اونی که از ته ته دلم دوستش دارم 💐"
        }
    },


    "international_girls_day": {
        "normal": [
            "🌍 تا روز جهانی دختر {days} روز مونده...",
            "🌸 شمارش معکوس روز جهانی دختر شروع شده؛ {days} روز باقی مونده 💖",
            "✨ فقط {days} روز تا روز جهانی دختر مونده 🌷"
        ],

        "special": {
            30: "🌍 فقط ۳۰ روز تا روز جهانی دختر مونده 💖",
            14: "✨ فقط ۱۴ روز تا روز جهانی دختر باقی مونده 🌸",
            7: "🎀 فقط یک هفته تا روز جهانی دختر مونده 💕",
            3: "🌍 فقط ۳ روز تا روز جهانی دختر مونده...",
            1: "💖 فردا روز جهانی دختره...",
            0: "🌸 هر روز که روز دختره بحثی توش نیست ولی روز جهانی دختر رو به همه دخترا تبریک میگم مخصوصا اون تک دختر ناز که عاشقشم 💐"
        }
    }
}